In [1]:
import pandas as pd
import numpy as np

In [2]:
titanic=pd.read_csv('C:/Users/ansh41/Desktop/mypython/codingNinja/datasets/training_titanic_x_y_train.csv')
df=titanic.copy()
df.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.000,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.050,NaN,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.000,NaN,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.075,NaN,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S,0

In [3]:
del df['Name']

In [4]:
del df['SibSp']

In [5]:
del df['Parch']

In [6]:
del df['Ticket']

In [7]:
df.head()

   Pclass     Sex   Age    Fare Cabin Embarked  Survived
0       2  female  29.0  26.000   NaN        S         1
1       3    male   NaN   8.050   NaN        S         0
2       2    male  39.0  26.000   NaN        S         0
3       3  female  29.0  21.075   NaN        S         0
4       3    male  25.0   7.050   NaN        S         0

In [8]:
def fun(s):
    if(s=="female"):
        return 0
    else:
        return 1

In [9]:
df['Gender']=df.Sex.apply(fun)
del df['Sex']

In [10]:
df['Cabin'].describe()
del df['Cabin']

In [11]:
df.head()
mask=((df.Embarked=='C') & (df.Survived==1))
df[mask].describe()

          Pclass       Age        Fare  Survived     Gender
count  75.000000  61.00000   75.000000      75.0  75.000000
mean    1.666667  28.70082   68.845059       1.0   0.320000
std     0.890389  13.38320   77.406643       0.0   0.469617
min     1.000000   0.75000    7.225000       1.0   0.000000
25%     1.000000  21.00000   15.741700       1.0   0.000000
50%     1.000000  27.00000   49.504200       1.0   0.000000
75%     3.000000  39.00000   89.104200       1.0   1.000000
max     3.000000  58.00000  512.329200       1.0   1.000000

In [12]:
def fun1(s):
    if(s=='S'):
        return 3
    elif(s=='Q'):
        return 2
    else:
        return 1

In [13]:
df['deport']=df.Embarked.apply(fun1)

In [14]:
del df['Embarked']

In [15]:
df.Age.fillna(df.Age.mean(),inplace=True)
df.head()
y_df=df['Survived']
del df['Survived']

In [16]:
x=np.array(df)
y=np.array(y_df)

In [17]:
print(x.shape)
print(y.shape)

(668, 5)
(668,)

In [18]:
from sklearn.linear_model import LogisticRegression
clf=LogisticRegression()

In [19]:
clf.fit(x,y)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

In [20]:
clf.score(x,y)

0.7859281437125748

In [21]:
test=pd.read_csv('C:/Users/ansh41/Desktop/mypython/codingNinja/datasets/test_titanic_x_test.csv')
df=test.copy()
df.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,"Davies, Master. John Morgan Jr",male,8.0,1,1,C.A. 33112,36.7500,NaN,S
1,1,"Leader, Dr. Alice (Farnham)",female,49.0,0,0,17465,25.9292,D17,S
2,3,"Kilgannon, Mr. Thomas J",male,NaN,0,0,36865,7.7375,NaN,Q
3,2,"Jacobsohn, Mrs. Sidney Samuel (Amy Frances Chr...",female,24.0,2,1,243847,27.0000,NaN,S
4,1,"McGough, Mr. James Robert",male,36.0,0,0,PC 17473,26.2875,E25,S

In [22]:
del df['SibSp']
del df['Parch']
del df['Ticket']
del df['Name']

In [23]:
df['Gender']=df.Sex.apply(fun)
del df['Sex']
df['deport']=df.Embarked.apply(fun1)
del df['Embarked']

In [24]:
del df['Cabin']

In [25]:
df.Age.fillna(df.Age.mean(),inplace=True)

In [26]:
x_test=np.array(df)
x_test.shape

(223, 5)

In [27]:
y_pred=clf.predict(x_test)

In [28]:
y_pred
np.savetxt('ff.csv',y_pred)